In [34]:
import os
from datetime import datetime as dt
import numpy as np
import shutil
import pandas as pd

In [35]:
##Enter Server Details
model_server = "files\\test\\"
new_server = "files\\test\\"

In [36]:
##Taking backup of original File Model Server
timestamp = str(dt.now().strftime("%Y-%m-%d-%H-%M-%S"))
file = "newGroup"
#file = input("Enter file to copy (without extention): ")
original_file = new_server + file + ".txt"
file_name, file_extension = os.path.splitext(original_file)
new_file = file_name + "_NEW_" + timestamp + file_extension
backup_file = file_name + "_BKP_" + timestamp + file_extension
shutil.copy(original_file, backup_file)
print("Backup created:",backup_file)

Backup created: files\test\newGroup_BKP_2024-03-10-18-23-22.txt

In [37]:
sdf = pd.read_csv('files\\test\modelGroup.txt', sep=':', names=["user", "source_uid", "source_gid", "source_mem"])
sdf

         user source_uid  source_gid                 source_mem
0        root      sdvsd         100                        NaN
1      unixsa   asdvasdv         101  nkumar10,draj,rrai,ksharm
2    oracledb    sdvasdv         102                abc,abd,abg
3  storageops     ssfeww         103       mganes,ysanam,jmitha
4        info      qwqew         104                  ravi,jitu
5         aaa     aedweu         105                        NaN

In [38]:
ddf = pd.read_csv("files\\test\\newGroup.txt", sep=':', names=["user", "dest_uid", "dest_gid", "dest_mem"])
ddf

         user  dest_uid  dest_gid        dest_mem
0        root     sdvsd       100             NaN
1      unixsa  asdvasdv       101             NaN
2    oracledb   sdvasdv       102     abc,abd,abg
3  storageops    ssfeww       103          mganes
4        engg   asaewwe       107  ahegde,saryaop

In [39]:
# Find common columns and indices
common_cols = sdf.columns.intersection(ddf.columns)
common_idx = ddf.index.intersection(ddf.index)
common_idx

RangeIndex(start=0, stop=5, step=1)

In [40]:
all_values = pd.concat([sdf["user"], ddf["user"]]).unique()
all_values

array(['root', 'unixsa', 'oracledb', 'storageops', 'info', 'aaa', 'engg'],
      dtype=object)

In [41]:
merged_df = pd.DataFrame(index=all_values)
merged_df

Empty DataFrame
Columns: []
Index: [root, unixsa, oracledb, storageops, info, aaa, engg]

In [42]:
# Join DataFrames based on the first column using outer join
result = sdf.merge(ddf, on="user", how='outer')
result["merged"] = result["dest_mem"]
result

,user,source_uid,source_gid,source_mem,dest_uid,dest_gid,dest_mem,merged
0,root,sdvsd,100.0,NaN,sdvsd,100.0,NaN,NaN
1,unixsa,asdvasdv,101.0,"nkumar10,draj,rrai,ksharm",asdvasdv,101.0,NaN,NaN
2,oracledb,sdvasdv,102.0,"abc,abd,abg",sdvasdv,102.0,"abc,abd,abg","abc,abd,abg"
3,storageops,ssfeww,103.0,"mganes,ysanam,jmitha",ssfeww,103.0,mganes,mganes
4,info,qwqew,104.0,"ravi,jitu",NaN,NaN,NaN,NaN
5,aaa,aedweu,105.0,NaN,NaN,NaN,NaN,NaN
6,engg,NaN,NaN,NaN,asaewwe,107.0,"ahegde,saryaop","ahegde,saryaop"

In [43]:
def add_missing_members(smem, dmem):
    
    #Convert string to numpy for comparision
    slist = np.array(smem.split(","))
    dlist = np.array(dmem.split(","))
    
    #Comparing differences and adding missing members
    missing = np.setdiff1d(slist, dlist)
    dlist = np.concatenate((dlist, missing))
    
    #Converting nummpy back to string
    return np.array2string(dlist)[2:-2].replace("' '", ","), missing

In [44]:
for index, row in result.iterrows():
    smem = row['source_mem']
    dmem = row['dest_mem']
    suid = row['source_uid']
    duid = row['dest_uid']
    group = str(row['user'])
    print(str(row['user']) +" | "+  str(smem) +" | "+ str(dmem))
    
    if duid is np.nan:
        result['merged'][index] = smem
        result['dest_uid'][index] = suid
        result['dest_gid'][index] = result['source_gid'][index]
        print("Added group("+group+"): ",smem)
    
    if smem == dmem:        ##Nothing to cmompare if the members already matches
        result['merged'][index] = dmem
    elif smem is not np.nan and dmem is not np.nan:      ##Only add missing members to the group
        result['merged'][index], missing = add_missing_members(str(smem), str(dmem))
        print("Members added to group("+group+"):",missing)
    elif smem is not np.nan:    ##Copy all members if model has no members
        result['merged'][index] = smem
        print("Members added to group("+group+"): ",smem)
        
    print("------")

root | nan | nan
------
unixsa | nkumar10,draj,rrai,ksharm | nan
Members added to group(unixsa):  nkumar10,draj,rrai,ksharm
------
oracledb | abc,abd,abg | abc,abd,abg
------
storageops | mganes,ysanam,jmitha | mganes
Members added to group(storageops): ['jmitha' 'ysanam']
------
info | ravi,jitu | nan
Added group(info):  ravi,jitu
Members added to group(info):  ravi,jitu
------
aaa | nan | nan
Added group(aaa):  nan
------
engg | nan | ahegde,saryaop
------

C:\Users\asus\AppData\Local\Temp\ipykernel_15772\3000742155.py:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result['merged'][index] = smem
C:\Users\asus\AppData\Local\Temp\ipykernel_15772\3000742155.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result['merged'][index] = dmem
C:\Users\asus\AppData\Local\Temp\ipykernel_15772\3000742155.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result['merged'][index], missing = add_missing_members(str(smem), str(dmem))
C:\Users\asus\AppData\Local\Temp\ipykernel_15772\3000742155.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result['merged'][index] = smem
C:\Users\asus\AppData\Local\Temp\ipykernel_15772\3000742155.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result['dest_uid'][index] = suid
C:\Users\asus\AppData\Local\Temp\ipykernel_15772\3000742155.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result['dest_gid'][index] = result['source_gid'][index]

In [45]:
result = result.astype({'dest_gid': 'int32'})
result

,user,source_uid,source_gid,source_mem,dest_uid,dest_gid,dest_mem,merged
0,root,sdvsd,100.0,NaN,sdvsd,100,NaN,NaN
1,unixsa,asdvasdv,101.0,"nkumar10,draj,rrai,ksharm",asdvasdv,101,NaN,"nkumar10,draj,rrai,ksharm"
2,oracledb,sdvasdv,102.0,"abc,abd,abg",sdvasdv,102,"abc,abd,abg","abc,abd,abg"
3,storageops,ssfeww,103.0,"mganes,ysanam,jmitha",ssfeww,103,mganes,"mganes,jmitha,ysanam"
4,info,qwqew,104.0,"ravi,jitu",qwqew,104,NaN,"ravi,jitu"
5,aaa,aedweu,105.0,NaN,aedweu,105,NaN,NaN
6,engg,NaN,NaN,NaN,asaewwe,107,"ahegde,saryaop","ahegde,saryaop"

In [46]:
df = result.to_string(index=False, header=None, na_rep='$', columns=['user','dest_uid','dest_gid','merged']).split('\n')
df = [':'.join(ele.split()) for ele in df]
df = [ele+"\n" for ele in df]
df = [element.replace('$','') for element in df]
df

['root:sdvsd:100:\n',
 'unixsa:asdvasdv:101:nkumar10,draj,rrai,ksharm\n',
 'oracledb:sdvasdv:102:abc,abd,abg\n',
 'storageops:ssfeww:103:mganes,jmitha,ysanam\n',
 'info:qwqew:104:ravi,jitu\n',
 'aaa:aedweu:105:\n',
 'engg:asaewwe:107:ahegde,saryaop\n']

In [47]:
file = open(new_file,"w")
file.writelines(df)
file.close()

In [ ]:
import pandas as pd
data = [['United States', 10, 12], ['United Kingdom', 15, 25], ['France', 14, 18]] 
df = pd.DataFrame(data, columns = ['Country', 'Number1', 'Number2']) 

df['Country']=df['Country'].str.replace(' ','_')
df = df.to_string(index=False).split('\n')
df = [','.join(ele.split()) for ele in df]
df = [element.replace('_',' ') for element in df]
df = '\r\n'.join(df)
df = df.encode('utf8')
df